<a href="https://colab.research.google.com/github/naveen63hdh/Data-Analytics/blob/main/Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 1.Creating Dataframe in Python


> In python there are more than ways to create a dataframe using pandas. We can create dataframe from lists, tuple, dictionary, numpy array, csv file and etc. We can also create an empty dataframe and add records to it.

> To create a dataframe we are loading pandas library in the alias pd, and we are also loading numpy in alias np to create dataframe from numpy array.

In [2]:
import numpy as np
import pandas as pd

## 1.1 Creating empty dataframe and adding records


> DataFrame constructor is used to create a empty dataframe. The columns attribute is a list of strings which become columns of the dataframe. DataFrame rows are reference loc method with index value.

In [3]:
df = pd.DataFrame(columns = ["Emp No","Emp Name","Salary"])

In [4]:
df.loc[0] = [101,"Jai",14000]
df.loc[1] = [102,"Kannan",10000]
df.loc[2] = [103,"Raman",7000]
df.loc[3] = [104,"Suresh",9000]
df.loc[4] = [105,"Sam",11000]

In [5]:
df

  Emp No Emp Name Salary
0    101      Jai  14000
1    102   Kannan  10000
2    103    Raman   7000
3    104   Suresh   9000
4    105      Sam  11000

## 1.2 Creating dataframe using numpy array

> In DataFrame constructor we can pass numpy array. Each row in  numpy array is the corresponding row required in the dataframe.

In [6]:
data = np.array([[101,"Jai",14000],
                 [102,"Kannan",10000],
                 [103,"Raman",7000],
                 [104,"Suresh",9000],
                 [105,"Sam",11000]
                ])

In [7]:
type(data)

numpy.ndarray

In [8]:
df = pd.DataFrame(data,columns = ["Emp No","Emp Name","Salary"])

In [9]:
df

  Emp No Emp Name Salary
0    101      Jai  14000
1    102   Kannan  10000
2    103    Raman   7000
3    104   Suresh   9000
4    105      Sam  11000

## 1.3 Creating dataframe using List

>  To Create a dataframe using list we have to pass the list in DataFrame constructor and we can give column names in colum attribute.

In [10]:
data = [[101,"Jai",14000],
        [102,"Kannan",10000],
        [103,"Raman",7000],
        [104,"Suresh",9000],
        [105,"Sam",11000]]

In [11]:
type(data)

list

In [12]:
df = pd.DataFrame(data,columns = ["Emp No","Emp Name","Salary"])

In [13]:
df

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

## 1.4 Creating dataframe using Dictionary 

> There are 3 ways to create a dataframe using dictonary 

* [Using Dictionary in DataFrame Constructor](https://colab.research.google.com/drive/1XbRrMi3RkTKGM0l4m1qsXH5LRggqSzrj#scrollTo=BlQdFRMOOwp3)
* [Using List of Dictionary](https://colab.research.google.com/drive/1XbRrMi3RkTKGM0l4m1qsXH5LRggqSzrj#scrollTo=_L6MDM4LOwp1&line=7&uniqifier=1)
* [Using from_dict method](https://colab.research.google.com/drive/1XbRrMi3RkTKGM0l4m1qsXH5LRggqSzrj#scrollTo=_L6MDM4LOwp1&line=7&uniqifier=1)

### 1.4.1 Using Dictionary in DataFrame Constructor


> If we pass dictionary in dataframe then dictionary keys become column names of dataframe and dictionary value becomes dataframe row values. Dictionary column are combined into single row according to the order of dictionary.

In [14]:
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}

In [15]:
type(data)

dict

In [16]:
df = pd.DataFrame(data)

In [17]:
df

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

### 1.4.2 Using List of Dictionary

> We can pass a list of dictionaries in DataFrame constructor. Each dictionary is considered as a record. Dictionary Keys become Column names in the dataframe. Dictionary values become the row values.

In [18]:
data = [{"Emp No":101,"Emp Name":"Jai","Salary":14000},
        {"Emp No":102,"Emp Name":"Kannan","Salary":10000},
        {"Emp No":103,"Emp Name":"Raman","Salary":7000},
        {"Emp No":104,"Emp Name":"Suresh","Salary":9000},
        {"Emp No":105,"Emp Name":"Sam","Salary":11000}]

In [19]:
type(data)

list

In [20]:
df = pd.DataFrame(data)

In [21]:
df

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

###  1.4.3 Using from_dict method

> Using **from_dict** is similar to first method except here we can specify whether the keys value should be a column  name or row index. 

> By default keys are identified as column names but we can change it by using **orient** attribute if  we give **index** to orient attribute it will change orientation of dataframe and passes the keys as row index. 

> If we  give orient as index then we can specify column name using columns attribute where we pass column name as list.

In [22]:
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}

In [23]:
type(data)

dict

In [24]:
df = pd.DataFrame().from_dict(data,orient="index",columns=['Emp1','Emp2','Emp3','Emp4','Emp5'])

In [25]:
df

           Emp1    Emp2   Emp3    Emp4   Emp5
Emp No      101     102    103     104    105
Emp Name    Jai  Kannan  Raman  Suresh    Sam
Salary    14000   10000   7000    9000  11000

## 1.5 Creating copy of dataframe

> In some scenarios me might need to do operations in dataframe without affecting the actual dataframe. In those situations we can use copy method and create a clone of the dataframe and work on it.

In [26]:
df1 = df.copy()

In [27]:
df1

           Emp1    Emp2   Emp3    Emp4   Emp5
Emp No      101     102    103     104    105
Emp Name    Jai  Kannan  Raman  Suresh    Sam
Salary    14000   10000   7000    9000  11000

# 2. Creating DataFrame from CSV and Saving it to CSV

> CSV(Comma Seperated Values) is the most commonly used format used for storing tabular data like spreadsheets and database. As name suggests in csv values are seperated or delimited by comma ( , )

> Pandas Provide methods for creating dataframe from a csv file and to export/save a dataframe into a csv file.

In [28]:
import pandas as pd

## 2.1 Creating DataFrame from CSV

> To create dataframe from csv pandas library provides a method called read_csv. read_csv method contains many attributes some of the most commonly used attributes are.


1.   **filepath_or_buffer** - URL/Dir location of the csv file goes here
2.   **sep** - Delimeter of csv file. Default value is ','
3.   **header** - Makes the passed row or rowas as column header
4.   **index_col** - Makes passed column as index
5.   **use_cols** - Used to retrive only specific columns

In [29]:
df_path = 'https://raw.githubusercontent.com/naveen63hdh/Data-Analytics/main/dataset.csv'

In [30]:
one_piece_df = pd.read_csv(df_path,sep = ',', header = 'infer', index_col = 'Character', usecols = ['Character','Devil Fruit','Class','Status'])

In [31]:
one_piece_df.head()

                       Devil Fruit      Class       Status
Character
Marshall D. Teach  Gura Gura no Mi  Paramecia     Consumed
Marshall D. Teach  Yami Yami no Mi      Logia     Consumed
Absalom            Suke Suke no Mi  Paramecia  Re-Consumed
Alpacaman             Alpaca SMILE      SMILE     Consumed
Alvida             Sube Sube no Mi  Paramecia     Consumed

## 2.2 Saving DataFrame as CSV
> To save a dataframe as a csv file pandas provide a method called to_csv()

In [32]:
data = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}

In [33]:
df = pd.DataFrame(data)

In [34]:
df.to_csv('my_dataset.csv')

# 3. Group by operations in DataFrame
    
> Pandas groupby() allows us to split our data into separate groups to perform computations for better analysis. groupby() returns the **DataFrameGroupBy** object.

> Using DataFrameGroupBy object we can do some analysis like getting speicfic group's values, number of groups, size of each group and etc.

> Some of the attributes and methods used to access DataFrameGroupBy are:

*   **ngroups** - Attribute to get number of groups
*   **groups** - Attribute that returns groupwise row number                
*   **size()** - Method to display group sizes
*   **first() and last()** - Methods to preview first and last entry of each group
*   **get_group()** - Method to retrive a dataframe for specific group

In [35]:
import pandas as pd

In [36]:
df_path = 'https://raw.githubusercontent.com/naveen63hdh/Data-Analytics/main/dataset.csv'

In [37]:
op_df = pd.read_csv(df_path)

In [38]:
devil_fruits = op_df.groupby('Class')

### 3.1 ngroups - Attribute to get number of **groups**

In [39]:
devil_fruits.ngroups

6

### 3.2 groups - Attribute that returns groupwise row number

In [40]:
devil_fruits.groups

{'(undetermined)': [96, 105, 163], 'Failed SMILE': [78, 98, 141, 150, 164], 'Logia': [1, 22, 28, 30, 50, 63, 104, 120, 135, 139, 140, 155], 'Paramecia': [0, 2, 4, 5, 7, 8, 9, 10, 13, 14, 15, 17, 18, 19, 23, 24, 25, 29, 31, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 54, 55, 57, 58, 60, 62, 65, 66, 68, 70, 71, 73, 75, 79, 85, 86, 89, 90, 94, 95, 97, 99, 102, 107, 109, 111, 112, 114, 121, 123, 126, 132, 133, 142, 143, 146, 147, 149, 151, 152, 153, 160, 161, 162, 166, 167, 168, 169, 170, 171, 172, 173, 178], 'SMILE': [3, 6, 11, 12, 26, 47, 48, 49, 51, 56, 61, 69, 72, 74, 76, 77, 80, 81, 82, 83, 84, 101, 108, 110, 124, 125, 129, 137, 144, 148, 156, 157, 158, 159, 174, 175, 176], 'Zoan': [16, 20, 21, 27, 32, 33, 52, 53, 59, 64, 67, 87, 88, 91, 92, 93, 100, 103, 106, 113, 115, 116, 117, 118, 119, 122, 127, 128, 130, 131, 134, 136, 138, 145, 154, 165, 177]}

### 3.3 size() - Method to display group sizes

In [41]:
devil_fruits.size()

Class
(undetermined)     3
Failed SMILE       5
Logia             12
Paramecia         85
SMILE             37
Zoan              37
dtype: int64

### 3.4 first() and last() - Methods to preview first and last entry of each group

In [42]:
devil_fruits.first()

                        Character  ...    Status
Class                              ...
(undetermined)             Karasu  ...  Consumed
Failed SMILE                  Han  ...  Consumed
Logia           Marshall D. Teach  ...  Consumed
Paramecia       Marshall D. Teach  ...  Consumed
SMILE                   Alpacaman  ...  Consumed
Zoan                         Bian  ...  Consumed

[6 rows x 5 columns]

In [43]:
devil_fruits.last()

                                   Character  ...    Status
Class                                         ...
(undetermined)                        Tamago  ...  Consumed
Failed SMILE                            Toko  ...  Consumed
Logia                                 Smoker  ...  Consumed
Paramecia                               Zala  ...  Consumed
SMILE           Wolf gifter (chapter 943) #2  ...  Consumed
Zoan                                 X Drake  ...  Consumed

[6 rows x 5 columns]

### 3.5 get_group() - Method to retrive a dataframe for specific group

In [44]:
devil_fruits.get_group('Logia')

             Character      Devil Fruit       Subclass Awakened       Status
1    Marshall D. Teach  Yami Yami no Mi  Regular Logia       No     Consumed
22           Borsalino  Pika Pika no Mi  Regular Logia       No     Consumed
28        Caesar Clown  Gasu Gasu no Mi  Regular Logia       No     Consumed
30             Caribou  Numa Numa no Mi  Regular Logia       No     Consumed
50           Crocodile  Suna Suna no Mi  Regular Logia       No     Consumed
63                Enel  Goro Goro no Mi  Regular Logia       No     Consumed
104              Kuzan    Hie Hie no Mi  Regular Logia       No     Consumed
120              Monet  Yuki Yuki no Mi  Regular Logia       No         Free
135     Portgas D. Ace  Mera Mera no Mi  Regular Logia       No  Re-Consumed
139               Sabo  Mera Mera no Mi  Regular Logia       No     Consumed
140           Sakazuki  Magu Magu no Mi  Regular Logia       No     Consumed
155             Smoker  Moku Moku no Mi  Regular Logia       No     Consumed

# 4. Combining and Merging in DataFrame

> Pandas Support both Horizontal and vertical combination of dataframes. **Horizontal combination** means combining dataframes in column level **merge()** and **join()** are the methods provided by pandas for horizontal combination.And **Vertical combination** means combining dataframes in row leve **concat()** and **append()** are the methods used for vertical combination.

In [45]:
import pandas as pd

## 4.1 merge() - Combining data on common columns or indices.


> Merging two dataset can be done in two ways

*   Merging dataframe with common column name
*   Merging dataframe with different column name

> Using how attribute in merge() each type can do 4 merge different operations 

*   Inner/Equi Join
*   Left Join
*   Right Join
*   Outer Join

### 4.1.1Merging dataframe with common column name

In [46]:
data1 = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}                

data2 = {'Emp No':[101,102,104,105,106,107],
        'Team id':[201,203,201,202,202,204],
        'Team Leader':['Vivek','Gaurav','Vivek','Vishwa','Vishwa','Guru']}

In [47]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [48]:
df1

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

In [49]:
df2

   Emp No  Team id Team Leader
0     101      201       Vivek
1     102      203      Gaurav
2     104      201       Vivek
3     105      202      Vishwa
4     106      202      Vishwa
5     107      204        Guru

### Inner/Equi Join

In [50]:
pd.merge(df1,df2)

   Emp No Emp Name  Salary  Team id Team Leader
0     101      Jai   14000      201       Vivek
1     102   Kannan   10000      203      Gaurav
2     104   Suresh    9000      201       Vivek
3     105      Sam   11000      202      Vishwa

In [51]:
pd.merge(df1,df2,how='inner')

   Emp No Emp Name  Salary  Team id Team Leader
0     101      Jai   14000      201       Vivek
1     102   Kannan   10000      203      Gaurav
2     104   Suresh    9000      201       Vivek
3     105      Sam   11000      202      Vishwa

### Left Join

In [52]:
pd.merge(df1,df2,how='left')

   Emp No Emp Name  Salary  Team id Team Leader
0     101      Jai   14000    201.0       Vivek
1     102   Kannan   10000    203.0      Gaurav
2     103    Raman    7000      NaN         NaN
3     104   Suresh    9000    201.0       Vivek
4     105      Sam   11000    202.0      Vishwa

### Right Join

In [53]:
pd.merge(df1,df2,how='right')

   Emp No Emp Name   Salary  Team id Team Leader
0     101      Jai  14000.0      201       Vivek
1     102   Kannan  10000.0      203      Gaurav
2     104   Suresh   9000.0      201       Vivek
3     105      Sam  11000.0      202      Vishwa
4     106      NaN      NaN      202      Vishwa
5     107      NaN      NaN      204        Guru

### Outer Join

In [54]:
pd.merge(df1,df2,how='outer')

   Emp No Emp Name   Salary  Team id Team Leader
0     101      Jai  14000.0    201.0       Vivek
1     102   Kannan  10000.0    203.0      Gaurav
2     103    Raman   7000.0      NaN         NaN
3     104   Suresh   9000.0    201.0       Vivek
4     105      Sam  11000.0    202.0      Vishwa
5     106      NaN      NaN    202.0      Vishwa
6     107      NaN      NaN    204.0        Guru

### 4.1.2Merging dataframe with different column name

In [55]:
data1 = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]
        }                

data2 = {'Emp Id':[101,102,104,105,106,107],
        'Team id':[201,203,201,202,202,204],
        'Team Leader':['Vivek','Gaurav','Vivek','Vishwa','Vishwa','Guru']
        }

In [56]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [57]:
df1

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

In [58]:
df2

   Emp Id  Team id Team Leader
0     101      201       Vivek
1     102      203      Gaurav
2     104      201       Vivek
3     105      202      Vishwa
4     106      202      Vishwa
5     107      204        Guru

In [59]:
pd.merge(df1,df2,left_on = 'Emp No',right_on = 'Emp Id',how = 'inner')

   Emp No Emp Name  Salary  Emp Id  Team id Team Leader
0     101      Jai   14000     101      201       Vivek
1     102   Kannan   10000     102      203      Gaurav
2     104   Suresh    9000     104      201       Vivek
3     105      Sam   11000     105      202      Vishwa

## 4.2 join() - combines data on a key column or an index.

>   join() is similar to merge() both are used to combine dataframe. In join() dataframes can be combined using index but whereas in merge we can combine using both index and columns

In [60]:
data1 = {'Emp No':[101,102,103,104,105],
        'Emp Name':['Jai','Kannan','Raman','Suresh','Sam'],
        'Salary':[14000,10000,7000,9000,11000]}                

data2 = {'Emp No':[101,102,104,105,106,107],
        'Team id':[201,203,201,202,202,204],
        'Team Leader':['Vivek','Gaurav','Vivek','Vishwa','Vishwa','Guru']}

In [66]:
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

In [67]:
df1

   Emp No Emp Name  Salary
0     101      Jai   14000
1     102   Kannan   10000
2     103    Raman    7000
3     104   Suresh    9000
4     105      Sam   11000

In [68]:
df2

   Emp No  Team id Team Leader
0     101      201       Vivek
1     102      203      Gaurav
2     104      201       Vivek
3     105      202      Vishwa
4     106      202      Vishwa
5     107      204        Guru

In [69]:
df1.join(df2,lsuffix = '_l',rsuffix = '_r')

   Emp No_l Emp Name  Salary  Emp No_r  Team id Team Leader
0       101      Jai   14000       101      201       Vivek
1       102   Kannan   10000       102      203      Gaurav
2       103    Raman    7000       104      201       Vivek
3       104   Suresh    9000       105      202      Vishwa
4       105      Sam   11000       106      202      Vishwa

## 4.3 concat() - combines Data Frames across rows or columns.